app/views/pages/dashboard.html.erb

SELECT "users".* FROM "users"
---
                    <%= form_with(model: @user, local: true, html: { class: 'form-horizontal' }) do |f| %>
                    <%= f.select :user, options_for_select([["Cambiar Rol"], "Visita", "Admin"]) %>