app/controllers/pages_controller.rb

  def dashboard
    @users = User.all
---
SELECT "users".* FROM "users"