app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "caca"], ["content", "asdasd"], ["user_id", 1], ["created_at", "2019-08-05 23:46:35.037469"], ["updated_at", "2019-08-05 23:46:35.037469"]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save